Repository: OSGeo-jp/OSGeoLive-doc-omegat
Catalog: tm/quickstart--zygrib_quickstart.tmx
Source language: en
Languages: ja

source: zyGrib Quickstart
ja: zyGribクイックスタート

source: zyGrib is a program to download and visualize weather forecast data in the standard GRIB distribution format.
ja: zyGribは、標準的なGRIB配布フォーマットで天気予報データをダウンロードして視覚化するプログラムです。

source: Start zyGrib
ja: zyGribを開始する

source: From the desktop, choose :menuselection:`Navigation and Maps --> zyGrib GRIB file viewer`.
ja: From the desktop, choose :menuselection:`ナビゲーションと地図 --> zyGrib GRIB file viewer`.

source: Select your preferred language and click :guilabel:`OK`. The program opens and you are presented with a map of the world.
ja: 使用する言語を選択し、:guilabel:`OK`をクリックします。プログラムが開き、世界のマップが表示されます。

source: Check the connection to the data server. On the toolbar at the top right of the screen, click the power plug icon. The File Server Status window opens and after a moment, it will confirm the status of the connection.
ja: データサーバーへの接続をチェックしてください。画面右上のツールバーで、電源プラグアイコンをクリックします。ファイルサーバーの状態ウィンドウが開き、しばらくすると接続の状態が確認されます。

source: You'll need an internet connection to download GRIB weather forecast data. You can get GRIB data from many sources, but as a convenience the zyGrib authors maintain a data server to use with zyGrib.
ja: GRIB天気予報データをダウンロードするにはインターネット接続が必要です。多くのソースからGRIBデータを取得することができますが、zyGribの作者は便宜上、zyGribで使用するデータサーバーを維持管理しています。

source: Download data
ja: データのダウンロード

source: Use the mouse to click and drag a box on the map canvas on a part of the world you are interested in. The Gulf of Mexico or the southern tip of Africa often have dynamic winds.
ja: マウスを使用して、地図キャンバス上のボックスをクリックして、関心のある世界の一部にドラッグします。メキシコ湾やアフリカの南端にはしばしばダイナミックな風があります。

source: With your box drawn on the map, click the zoom-to-box icon on the taskbar (the magnifying glass with a small box underneath it)
ja: 地図にボックスを描画した状態で、タスクバーのボックスズームアイコン(小さなボックスが下にある虫眼鏡)をクリックします。

source: Again, mark out a box of interest with a left-click drag, but this time covering most or all of the zoomed-in map canvas.
ja: 再度、左クリックドラッグで対象のボックスをマークします。ただし、今回は拡大されたマップキャンバスのほとんどまたはすべてをカバーしています。

source: Select :menuselection:`File --> Download GRIB` and select the features you want to download. If in doubt, accept the defaults.
ja: :menuselection:`File-->Download GRIB`を選択し、ダウンロードしたい地物を選択します。よくわからない場合は、デフォルトを受け入れてください。

source: When ready click the ``Download`` button, and save the file to disk.
ja: 準備ができたら、``Download``ボタンをクリックし、ファイルをディスクに保存します。

source: The application displays a weather map with a time slider along the bottom, set for the current time. You can use the mouse wheel to zoom in if you like.
ja: アプリケーションは、現在の時刻に設定されたタイムスライダが下部に表示された気象マップを表示します。マウスホイールを使用してズームインすることもできます。

source: Change views
ja: ビューの変更

source: Move the mouse around the map you'll see the exact conditions listed in the pane on the left.
ja: マップの周りでマウスを動かすと、左側のペインに正確な条件が表示されます。

source: You can change the time by moving the slider along the bottom, or from the drop down menu in the top-left of the window.
ja: 時間を変更するには、下部に沿ってスライダを移動するか、ウィンドウの左上にあるドロップダウンメニューから移動します。

source: From the ``Weather map`` menu, select a variable to visualize. For example, select :menuselection:`Weather map --> Cloud cover` and the view should change.
ja: ``Weather map``メニューから、視覚化する変数を選択します。たとえば、:menuselection:`Weather map-->Cloud cover`を選択すると、ビューが変更されます。

source: If you downloaded data for the Gulf of Mexico you'll be interested to view the CAPE data. "CAPE" stands for Convective Available Potential Energy at ground level. It is a measure of atmospheric instability, and high values (1000s of J/kg) indicate a threat of thunderstorms and/or tornadoes.
ja: メキシコ湾のデータをダウンロードした場合、CAPEデータのビューに興味があるでしょう。"CAPE"は対流利用可能ポテンシャルエネルギー(Convection Available Potential Energy)の略です。これは大気の不安定性の尺度であり、高い値(1000J/kg)は雷雨や竜巻の脅威を示します。

source: If you downloaded data for southern Africa, cloud cover may be more interesting.
ja: アフリカ南部のデータをダウンロードした場合は、雲量の方が興味深いかもしれません。

source: Create an animation
ja: アニメーションを作成する

source: Click the right-hand most icon on the toolbar (a rocketship). A new window opens and an animation will be generated.
ja: ツールバーの右端のアイコン(ロケットシップ)をクリックします。新しいウィンドウが開き、アニメーションが生成されます。

source: Wait while it runs through the time sequence for the first time. When it is done it will rewind to the beginning of the time series.
ja: 最初に実行されるまで待ちます。終了すると、時系列の先頭に戻ります。

source: You can play, pause and rewind the sequence as you like.
ja: 再生、一時停止、巻き戻しが可能です。

source: You can also save each frame as an image file for later encoding into an AVI, MPEG, or animated GIF `using other software <https://grasswiki.osgeo.org/wiki/Movies>`_.
ja: 各フレームを画像ファイルとして保存して、後で他のソフトウェア<https://grasswiki.osgeo.org/wiki/Movies>`_を使用してAVI、MPEG、またはアニメーションGIF`にエンコードすることもできます。

source: When you're done, click the red power button to close.
ja: 終了したら、赤い電源ボタンをクリックして閉じます。

source: What next?
ja: 次のステップ

source: The :doc:`OpenCPN software <../overview/opencpn_overview>` (also on this disc) has a GRIB overlay plugin which you may try with your newly downloaded GRIB file. See the :doc:`OpenCPN quickstart <../quickstart/opencpn_quickstart>` for details.
ja: :doc:`OpenCPNソフトウェア<../overview/opencpn_overview>`(このディスクにもあります)にはGRIBオーバーレイプラグインがあり、新しくダウンロードしたGRIBファイルで試すことができます。詳細は、:doc:`クイックスタート文書<./quickstart/opencpn_quickstart>`を参照してください。

source: Website: https://www.zygrib.org
ja: Webサイト: https://www.zygrib.org

source: Support: https://zygrib.org/forum/
ja: サポート: https://zygrib.org/forum/
